# DTM6_ShowSendEdgeDlg

## Description
Shows the Send to Surface dialog for modifier objects with retaining edge.

```pascal
FUNCTION DTM6_ShowSendEdgeDlg(objWEdgeType : INTEGER): INTEGER;
```

```python
def vs.DTM6_ShowSendEdgeDlg(objWEdgeType):
    return INTEGER
```

## Parameters
|Name|Type|Description|
|---|---|---|
|objWEdgeType|INTEGER|   |

## Version
Availability: from Vectorworks 2014

## Category
* SiteModel Interface Library